=begin
= ChangeLog
== ver 0.6 2009-08-11T23:45:52+09:00
* リファクタリング
* ヴァージョンナンバーを増やした
* ほとんどのバグ修正
* ほんの少しだけエンバグ(爆
== ver 0.5b2 2008-08-27T12:17:46+09:00
* ディレクトリ構成の変更
== ver 0.5b1 2007-05-18T22:30:56+09:00
* PRIVMSG/NOTICE中の半角スペースが無くなってしまうバグを修正(Thanks>kusigahamaさん)
* OPER実装
  * DIE, CLOSE, REHAH, RESTART を実装

== ver 0.2b1 2007-04-29T19:32:40+09:00
* 同時に沢山の人が接続を切ったときに発生する問題を修正

== ver 0.1b2 2007-04-08T22:17:29+09:00
* AWAY の実装
* "+" で始まるチャンネル(モード無しチャンネル)実装
* クエリを幾つか実装(who, whois, whowas, ison, userhost)
* KICK コマンドを実装
* チャンネルモードの実装を修正
* 例外の実装を変更
* ユーザがチャンネルを去ったときにきちんと登録が抹消されない問題を修正
* ライブラリ構成を変更
* ドキュメントかいた

== ver 0.1b1 2007-03-29T21:48:43+09:00
* Announce

=end